Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.workspace.env.error.unknownFlag
source: workspace env: unknown flag '%@'. Known flags: --workspace <id|ref|index>, --window <id|ref|index>, --mask
ar: workspace env: علامة غير معروفة '%@'. العلامات المعروفة: --workspace <id|ref|index>، --window <id|ref|index>، --mask
de: workspace env: unbekanntes Flag „%@“. Bekannte Flags: --workspace <id|ref|index>, --window <id|ref|index>, --mask
es: workspace env: opción desconocida '%@'. Opciones conocidas: --workspace <id|ref|índice>, --window <id|ref|índice>, --mask
fr: workspace env : option inconnue '%@'. Options connues : --workspace <id|ref|index>, --window <id|ref|index>, --mask
ja: workspace env: 不明なフラグ '%@'。利用可能なフラグ: --workspace <id|ref|index>, --window <id|ref|index>, --mask
ko: workspace env: 알 수 없는 플래그 '%@'. 사용 가능한 플래그: --workspace <id|ref|index>, --window <id|ref|index>, --mask
uk: workspace env: невідомий прапорець '%@'. Доступні прапорці: --workspace <id|ref|index>, --window <id|ref|index>, --mask
zh_hans: workspace env：未知标志 '%@'。已知标志：--workspace <id|ref|index>、--window <id|ref|index>、--mask
zh_hant: workspace env：未知的旗標 '%@'。選用旗標：--workspace <id|ref|index>, --window <id|ref|index>, --mask

# cli.workspace.envFile.error.readFailed
source: %@: could not read --env-file '%@': %@
ar: %@: تعذر قراءة --env-file من '%@': %@
de: %@: --env-file „%@“ konnte nicht gelesen werden: %@
es: %@: no se pudo leer --env-file '%@': %@
fr: %@ : impossible de lire --env-file '%@' : %@
ja: %@: --env-file '%@' を読み込めませんでした: %@
ko: %@: --env-file '%@'을(를) 읽을 수 없습니다: %@
uk: %@: не вдалося прочитати --env-file '%@': %@
zh_hans: %@：无法读取 --env-file '%@'：%@
zh_hant: %@：無法讀取 --env-file '%@'：%@

# cli.workspace.status.usage
source: Usage: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Show or pin a workspace's todo lifecycle status. Without arguments prints the effective status, the inferred status, and the override, targeting the caller's workspace by default. Lanes are inferred from live signals (agent needs input > agent running > open PR > all PRs merged/closed > dirty git tree > todo). `set <lane>` pins a manual lane that auto-clears as soon as the inferred lane changes; `set auto` clears the pin immediately. `cycle` advances the manual override one lane forward (todo → working → needs-attention → review → done → todo). Note for coding agents: manual status pins belong to the user; the lane already tracks your activity automatically. Do not `set` or `cycle` the status unless the user explicitly asks you to. Lanes: todo, working, needs-attention, review, done Examples: cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
ar: الاستخدام: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] عرض حالة دورة حياة المهام لمساحة عمل أو تثبيتها. بدون وسائط، يطبع الحالة الفعلية، والحالة المستنتجة، والتجاوز، مستهدفًا مساحة عمل المستدعي افتراضيًا. يتم استنتاج المسارات من الإشارات الحية (الوكيل بحاجة لمدخلات > الوكيل قيد التشغيل > طلب سحب مفتوح > تم دمج/إغلاق جميع طلبات السحب > شجرة git غير نظيفة > مهام للقيام بها). `set <lane>` يثبت مسارًا يدويًا يُمحى تلقائيًا بمجرد تغير المسار المستنتج؛ `set auto` يمحو التثبيت فورًا. `cycle` ينقل التجاوز اليدوي مسارًا واحدًا إلى الأمام (مهام للقيام بها ← قيد العمل ← بحاجة لاهتمام ← مراجعة ← منجز ← مهام للقيام بها). ملاحظة لوكلاء البرمجة: تثبيتات الحالة اليدوية تخص المستخدم؛ المسار يتتبع نشاطك بالفعل وتلقائيًا. لا تقم بـ `set` أو `cycle` لـ الحالة ما لم يطلب منك المستخدم ذلك صراحةً. المسارات: todo, working, needs-attention, review, done أمثلة: cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
de: Verwendung: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Zeigt den Todo-Lebenszyklusstatus eines Arbeitsbereichs an oder pinnt ihn. Ohne Argumente werden der effektive Status, der abgeleitete Status und die Überschreibung ausgegeben, wobei standardmäßig der Arbeitsbereich des Aufrufers angepeilt wird. Spalten werden aus Live-Signalen abgeleitet (Agent benötigt Eingabe > Agent läuft > offener PR > alle PRs zusammengeführt/geschlossen > unsauberer Git-Tree > Todo). `set <lane>` pinnt eine manuelle Spalte, die sich automatisch löscht, sobald sich die abgeleitete Spalte ändert; `set auto` löscht den Pin sofort. `cycle` verschiebt die manuelle Überschreibung eine Spalte weiter (todo → working → needs-attention → review → done → todo). Hinweis für Programmier-Agenten: Manuelle Status-Pins gehören dem Benutzer; die Spalte verfolgt Ihre Aktivität bereits automatisch. Verwenden Sie `set` oder `cycle` für den Status nur, wenn der Benutzer Sie ausdrücklich darum bittet. Spalten: todo, working, needs-attention, review, done Beispiele: cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
es: Uso: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|índice>] [--window <id|ref|índice>] [--json] Muestra o fija el estado del ciclo de vida de tareas pendientes de un espacio de trabajo. Sin argumentos, imprime el estado efectivo, el estado inferido y la anulación, dirigiéndose al espacio de trabajo del llamador por defecto. Las etapas se infieren de señales en vivo (el agente necesita entrada > agente en ejecución > PR abierta > todas las PR fusionadas/cerradas > árbol de git sucio > todo). `set <lane>` fija una etapa manual que se limpia automáticamente tan pronto como la etapa inferida cambie; `set auto` limpia la fijación inmediatamente. `cycle` avanza la anulación manual una etapa hacia adelante (todo → working → needs-attention → review → done → todo). Nota para agentes de programación: las fijaciones de estado manuales pertenecen al usuario; la etapa ya realiza un seguimiento de tu actividad automáticamente. No utilices `set` ni `cycle` para el estado a menos que el usuario te lo pida explícitamente. Etapas: todo, working, needs-attention, review, done Ejemplos: cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
fr: Utilisation : cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] Affiche ou épingle le statut du cycle de vie todo d'un espace de travail. Sans argument, affiche le statut effectif, le statut déduit et la surcharge, en ciblant l' espace de travail de l'appelant par défaut. Les colonnes (lanes) sont déduites de signaux en temps réel (l'agent a besoin d'une entrée > agent en cours d'exécution > PR ouverte > toutes les PR fusionnées/fermées > arbre git sale > todo). `set <lane>` épingle une colonne manuelle qui s'efface automatiquement dès que la colonne déduite change ; `set auto` efface l'épinglage immédiatement. `cycle` fait avancer la surcharge manuelle d'une colonne (todo → working → needs-attention → review → done → todo). Note pour les agents de codage : les épinglages manuels de statut appartiennent à l'utilisateur ; la colonne suit déjà automatiquement votre activité. Ne définissez pas (`set`) et ne faites pas défiler (`cycle`) le statut à moins que l'utilisateur ne vous le demande explicitement. Colonnes (lanes) : todo, working, needs-attention, review, done Exemples : cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
ja: 使用方法: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] ワークスペースの todo ライフサイクルステータスを表示またはピン留めします。引数なしの場合は、 有効なステータス、推測されたステータス、およびオーバーライドを出力します。デフォルトで 呼び出し元のワークスペースが対象となります。 レーンはライブシグナルから推測されます（エージェントが要入力を検出 > エージェント実行中 > オープンな PR > すべての PR がマージ/クローズ済み > 変更のある git ツリー > todo）。`set <lane>` は手動レーンをピン留めし、推測されたレーンが変更されるとすぐに自動クリアされます。 `set auto` は即座にピン留めをクリアします。`cycle` は手動オーバーライドを 1つ先のレーンに進めます（todo → working → needs-attention → review → done → todo）。 コーディングエージェントへの注意: 手動のステータスピンはユーザーのものです。レーンは すでに自動的にあなたのアクティビティを追跡しています。ユーザーから明示的な 要求がない限り、ステータスを `set` または `cycle` しないでください。 レーン: todo, working, needs-attention, review, done 例: cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
ko: 사용법: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] 작업 공간의 할 일 생명주기 상태를 표시하거나 고정합니다. 인자 없이 실행하면 유효 상태, 추론 상태 및 재정의 상태를 출력하며, 기본적으로 호출자의 작업 공간을 대상으로 합니다. 단계(lane)는 라이브 신호(에이전트 입력 필요 > 에이전트 실행 중 > 열려 있는 PR > 모든 PR 병합/종료 > 수정 사항이 있는 git 트리 > 할 일)로부터 추론됩니다. `set <lane>`은(는) 추론된 단계가 변경되는 즉시 자동으로 해제되는 수동 단계를 고정합니다. `set auto`는 고정을 즉시 해제합니다. `cycle`은 수동 재정의를 한 단계 앞으로 이동시킵니다 (todo → working → needs-attention → review → done → todo). 코딩 에이전트 참고 사항: 수동 상태 고정은 사용자의 소유이며, 단계는 이미 에이전트의 활동을 자동으로 추적하고 있습니다. 사용자가 명시적으로 요청하지 않는 한 상태를 `set`하거나 `cycle`하지 마십시오. 단계: todo, working, needs-attention, review, done 예시: cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
zh_hans: 用法: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] 显示或固定工作区的 todo 生命周期状态。在不带参数时会打印 生效状态、推断状态和覆盖状态，默认指向 调用者的工作区。 泳道是通过实时信号推断出的（智能体需要输入 > 智能体运行中 > 开启的 PR > 所有 PR 已合并/关闭 > dirty git 树 > todo）。`set <lane>` 会固定一个手动泳道，一旦推断的泳道发生变化就会自动清除； `set auto` 会立即清除固定。`cycle` 会将手动覆盖 向前推进一个泳道（todo → working → needs-attention → review → done → todo）。 编程智能体请注意：手动状态固定属于用户；泳道 已经自动跟踪您的活动。除非用户明确要求， 否则请不要 `set` 或 `cycle` 该状态。 泳道：todo, working, needs-attention, review, done 示例： cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
zh_hant: 用法: cmux workspace status [set <lane|auto> | cycle] [--workspace <id|ref|index>] [--window <id|ref|index>] [--json] 顯示或釘選工作區的待辦生命週期狀態。不帶參數時會列印 有效狀態、推導狀態以及覆寫狀態，預設目標為 呼叫端的工作區。 泳道是根據即時訊號推導而來（代理程式需要輸入 > 代理程式執行中 > 開啟的 PR > 所有 PR 已合併/關閉 > 未提交變更的 git 樹 > 待辦）。`set <lane>` 會釘選一個手動泳道，在推導泳道變更時該泳道會自動清除； `set auto` 會立即清除釘選。`cycle` 會將手動覆寫向 前推進一個泳道（待辦 → 進行中 → 需要關注 → 審查 → 完成 → 待辦）。 開發代理程式注意事項：手動狀態釘選屬於使用者；泳道 已自動追蹤您的活動。除非使用者明確要求，否則請勿 `set` 或 `cycle` 此狀態。 泳道：todo, working, needs-attention, review, done 範例： cmux workspace status cmux workspace status set review cmux workspace status cycle cmux workspace status set auto --workspace workspace:2
